from src.services import just_search


def test_just_search(transactions_list: list[dict]) -> None:
    """Тест для функции just_search."""
    assert just_search("Так", transactions_list) == (
        "[\n"
        "    {\n"
        '        "Дата операции": "2021-11-15 01:10:10",\n'
        '        "Дата платежа": "16.11.2021",\n'
        '        "Номер карты": "*7197",\n'
        '        "Статус": "OK",\n'
        '        "Сумма операции": -105.0,\n'
        '        "Валюта операции": "RUB",\n'
        '        "Сумма платежа": -105.0,\n'
        '        "Валюта платежа": "RUB",\n'
        '        "Кэшбэк": null,\n'
        '        "Категория": "",\n'
        '        "MCC": 4121.0,\n'
        '        "Описание": "Яндекс Такси",\n'
        '        "Бонусы (включая кэшбэк)": 2,\n'
        '        "Округление на инвесткопилку": 0,\n'
        '        "Сумма операции с округлением": 105.0\n'
        "    },\n"
        "    {\n"
        '        "Дата операции": "2021-11-14 16:23:04",\n'
        '        "Дата платежа": "15.11.2021",\n'
        '        "Номер карты": "*7197",\n'
        '        "Статус": "OK",\n'
        '        "Сумма операции": -152.0,\n'
        '        "Валюта операции": "RUB",\n'
        '        "Сумма платежа": -152.0,\n'
        '        "Валюта платежа": "RUB",\n'
        '        "Кэшбэк": null,\n'
        '        "Категория": "Такси",\n'
        '        "MCC": 4121.0,\n'
        '        "Описание": "Яндекс Такси",\n'
        '        "Бонусы (включая кэшбэк)": 3,\n'
        '        "Округление на инвесткопилку": 0,\n'
        '        "Сумма операции с округлением": 152.0\n'
        "    },\n"
        "    {\n"
        '        "Дата операции": "2021-09-20 15:00:43",\n'
        '        "Дата платежа": "22.09.2021",\n'
        '        "Номер карты": "*7197",\n'
        '        "Статус": "OK",\n'
        '        "Сумма операции": -252.0,\n'
        '        "Валюта операции": "RUB",\n'
        '        "Сумма платежа": -252.0,\n'
        '        "Валюта платежа": "RUB",\n'
        '        "Кэшбэк": null,\n'
        '        "Категория": "Такси",\n'
        '        "MCC": 4121.0,\n'
        '        "Описание": "Яндекс Такси",\n'
        '        "Бонусы (включая кэшбэк)": 5,\n'
        '        "Округление на инвесткопилку": 0,\n'
        '        "Сумма операции с округлением": 252.0\n'
        "    }\n"
        "]"
    )
